# Анализ временной сложности:
# В данном примере временная сложность составляет O(n), где n - это количество элементов в списке.
# Чтобы найти искомый элемент, может потребоваться перебрать вес список (если искомый элемент будет находиться в конце).
# Линейный поиск - это простой алгоритм, но он не очень эффективен для больших списков.

# Анализ пространственной сложности:
# Пространственная сложность O(1) так как в памяти находится только 1 элемент.
# Линейный поиск очень экономичен с точки зрения использования памяти.
# Он не создает никаких дополнительных структур данных, размер которых зависел бы от размера входных данных.
# Это делает его хорошим выбором, когда объем памяти ограничен.